app/controllers/cameras_controller.rb

  def index
    @cameras = Camera.where(available: true)
---
SELECT "cameras".* FROM "cameras" WHERE "cameras"."available" = 't'